//#include <stdio.h>

#if 0
char a[20][21]; //用来存储地图

int getnum(int i, int j)
{
	int sum, x, y;
	sum = 0;//sum用来计数(可以消灭的敌人数),所以需要初始化为0
	//将坐标i, j复制到两个新变量x, y中, 以便之后向上下左右四个方向统计可以消灭的敌人数
	//向上统计可以消灭的敌人数
	x = i; y = j;
	while (a[x][y] != '#') //判断的点是不是墙, 如果不是就继续
	{
		//如果当前的点是敌人, 则进行技术
		if (a[x][y] == 'G')
		{
			sum++;
		}
		//x--作用是继续向上统计
		x--;
	}
	//向下统计可以消灭的敌人数
	x = i; y = j;
	while (a[x][y] != '#')
	{
		if (a[x][y] == 'G')
		{
			sum++;
		}
		//x++的作用是继续向下统计
		x++;
	}
	//向左统计可以消灭的敌人数
	x = i; y = j;
	while (a[x][y] != '#')
	{
		if (a[x][y] == 'G')
		{
			sum++;
		}
		//y--的作用是继续向左统计
		y--;
	}
	x = i; y = j;
	while (a[x][y] != '#')
	{
		if (a[x][y] == 'G')
		{
			sum++;
		}
		//y++的作用是继续向右统计
		y++;
	}
	return sum;
}
#endif