#include <stdio.h>

int a[10], book[10], total;

void dfs_match(int step)//表示站在第几个盒子面前
{
	int i;
	if (step == 10)//如果站在第10个盒子前, 表示前9个盒子已经放好牌
	{
		//判断是否满足等式□□□+□□□=□□□
		if (a[1] * 100 + a[2] * 10 + a[3] + a[4] * 100 + a[5] * 10 + a[6] == a[7] * 100 + a[8] * 10 + a[9])
		{
			//如果满足要求, 可行解+1, 并打印这个解
			total++;
			printf("%d%d%d+%d%d%d=%d%d%d\n", a[1], a[2], a[3], a[4], a[5], a[6], a[7], a[8], a[9]);
		}
	}
	for (i = 1; i <= 9; i++)
	{
		//判断扑克牌i是否还在手上
		if (book[i] == 0)//表示扑克牌在手上
		{
			//开始尝试使用扑克牌
			a[step] = i;
			book[i] = 1; //牌不在手上
			//第step个盒子已经放好扑克牌, 接下来要走到下一盒子前
			dfs_match(step+1);//递归到下一个盒子
			book[i] = 0;//要取回扑克牌才能进行下一步
		}
	}
}